content/index.org
#+TITLE: The Way of Emacs
#+SUBTITLE: Undestroyable hope justified
#+OPTIONS: toc:nil

** Welcome

I work in quiet strength, anchored in undestroyable hope justified by action, craft, and clarity.

Note that this isn't about learning the Emacs editor: there's already a *super* tutorial built in.  Just do this:

1. Get emacs [[https://www.gnu.org/software/emacs/download.html][from this site]]. Instructions are included.

2. Run emacs, and when it comes up, type "C-h t" -- that is, hold down the ~ctrl~ key and press "h", let go of all keys, and press t.  From there, just follow the instructions in the tutorial that comes up.

This *is*, though, a site where you can learn to use *org-mode* to do amazing things, and build your hope in the process.

