index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Way of Emacs</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class='site-nav'><a href='/index.html'>Home</a> | <a href='/sitemap.html'>Sitemap</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">The Way of Emacs</h1>
<p class="subtitle" role="doc-subtitle">Undestroyable hope justified</p>
</header><div id="outline-container-orgcc8082b" class="outline-2">
<h2 id="orgcc8082b">Welcome</h2>
<div class="outline-text-2" id="text-orgcc8082b">
<p>
I work in quiet strength, anchored in undestroyable hope justified by action, craft, and clarity.
</p>

<p>
Note that this isn&rsquo;t about learning the Emacs editor: there&rsquo;s already a <b>super</b> tutorial built in.  Just do this:
</p>

<ol class="org-ol">
<li>Get emacs <a href="https://www.gnu.org/software/emacs/download.html">from this site</a>. Instructions are included.</li>

<li>Run emacs, and when it comes up, type &ldquo;C-h t&rdquo; &#x2013; that is, hold down the <code>ctrl</code> key and press &ldquo;h&rdquo;, let go of all keys, and press t.  From there, just follow the instructions in the tutorial that comes up.</li>
</ol>

<p>
This <b>is</b>, though, a site where you can learn to use <b>org-mode</b> to do amazing things, and build your hope in the process.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='postamble' class='postamble'>Copyright &copy; 2025 by <a href='mailto:williamwear@gmail.com'>Bill Wear</a>. All rights reserved; please contact for permission.</div>
</div>
</body>
</html>
